Autodesk.Navisworks.Api.VariantDataType
Type of data stored in a VariantData class.

Autodesk.Navisworks.Api.VariantDataType.None
Empty. No data stored.

Autodesk.Navisworks.Api.VariantDataType.Double
Unitless double value

Autodesk.Navisworks.Api.VariantDataType.Int32
Unitless 32 bit integer value

Autodesk.Navisworks.Api.VariantDataType.Boolean
Boolean (true/false) value

Autodesk.Navisworks.Api.VariantDataType.DisplayString
String intended for display to the end user (normally localized)

Autodesk.Navisworks.Api.VariantDataType.DateTime
A specific date and time (usually UTC)

Autodesk.Navisworks.Api.VariantDataType.DoubleLength
A double that represents a length (specific units depend on context)

Autodesk.Navisworks.Api.VariantDataType.DoubleAngle
A double that represents an angle in radians

Autodesk.Navisworks.Api.VariantDataType.NamedConstant
A named constant

Autodesk.Navisworks.Api.VariantDataType.IdentifierString
String intended to be used as a programmatic identifier. 7-bit ASCII characters only.

Autodesk.Navisworks.Api.VariantDataType.DoubleArea
A double that species an area (specific units depend on context)

Autodesk.Navisworks.Api.VariantDataType.DoubleVolume
A double that species a volume (specific units depend on context)

Autodesk.Navisworks.Api.VariantDataType.Point3D
A 3D point value

Autodesk.Navisworks.Api.VariantDataType.Point2D
A 2D point value

Autodesk.Navisworks.Api.VariantDataType.Nat32
Unsigned 32 bit integer value

Autodesk.Navisworks.Api.VariantDataType.Int64
64 bit integer value

Autodesk.Navisworks.Api.VariantDataType.Nat64
Unsigned 64 bit integer value